<?php

class TranslateNumberUA extends TranslateNumber {
	protected static $leng = [
		'-' => 'мінус ',
		'unique' => [
			'11' => 'одинадцять ',
			'12' => 'дванадцять ',
			'13' => 'тринадцять ',
			'14' => 'чотырнадцять ',
			'15' => 'п\'ятнадцять ',
			'16' => 'шістнадцять ',
			'17' => 'сімнадцять ',
			'18' => 'вісімнадцять ',
			'19' => 'дев\'ятнадцять '
		],
		'0' => 'нуль',
		'1' => ['один ','два ','три ','чотири ','п\'ять ','шість ','сім ','вісім ','дев\'ять '],
		'2' => ['десять ','двадцять ','тридцять ','сорок ','п\'ятдесят ','шістдесят ','сімдесят ','вісімдесят ','дев\'яносто '],
		'3' => ['сто ','двісті ','триста ','чотириста ','п\'ятсот ','шістсот ','сімсот ','вісімсот ','дев\'ятсот '],
		'4' => ['одна ','дві ','три ','чотири ','п\'ять ','шість ','сім ','вісім ','дев\'ять '],
		'ends' => [],
		'parts' => [
			'1' => [
				'/^([^1]|\d[^1])?1$/' => 'тисяча ',
				'/^([^1]|\d[^1])?(2|3|4)$/' => 'тисячі ',
				'//' => 'тисяч '
			],
			'2' => [
				'/^([^1]|\d[^1])?1$/' => 'мільйон ',
				'/^([^1]|\d[^1])?(2|3|4)$/' => 'мільйони ',
				'//' => 'мільйонів '
			],
			'3' => [
				'/^([^1]|\d[^1])?1$/' => 'мільярд ',
				'/^([^1]|\d[^1])?(2|3|4)$/' => 'мільярди ',
				'//' => 'мільярдів '
			]
		]
	];
}